import Header from "../general/Header";
import ".././../assets/css/homepage.css";


export default function AboutSection() {
  return (

    <section className="homepageSection m-top aboutSection p-inline">

        <Header text="من نحن"/>
      <div className="aboutSection__content">


        <p className="aboutSection__text">

        مدرسة القرية السياحية الأولى الرسمية للغات هي مؤسسة تعليمية متكاملة تقع في منطقة السادس من أكتوبر بمصر، وتعد من المدارس الرائدة التي تهدف إلى تقديم مستوى تعليمي متقدم يعتمد على تعزيز المهارات اللغوية والمعرفية للطلاب في مختلف المراحل التعليمية. تهتم المدرسة بتدريس اللغة الإنجليزية كلغة أساسية إلى جانب اللغات الأخرى مثل الفرنسية والعربية، مما يتيح للطلاب امتلاك مهارات لغوية متعددة تساعدهم في التواصل العالمي وتعزز من فرصهم المستقبلية في التعليم والعمل.

تُطبِّق المدرسة مناهج وزارة التربية والتعليم المصرية، مع إضافة مجموعة من الأنشطة اللاصفية والبرامج التعليمية التي تسهم في تنمية شخصية الطالب بشكل شامل. وتشمل هذه الأنشطة المجالات الرياضية والفنية والثقافية، مما يساعد في تطوير مهاراتهم الاجتماعية وتعزيز روح التعاون والعمل الجماعي بينهم. تركز المدرسة بشكل خاص على تفعيل دور الأنشطة العلمية والتجريبية التي تشجع الطلاب على الإبداع والابتكار، وتعمل على دعم مواهبهم وتوجيههم نحو الاهتمامات العلمية والأكاديمية.

من الناحية التربوية، تولي المدرسة اهتماماً كبيراً لبناء جيل قادر على التفكير النقدي والتحليل، إذ تُنظَّم برامج خاصة تركز على تنمية هذه المهارات من خلال أساليب تدريس حديثة تعتمد على التفاعل والمشاركة الفعالة في الفصل. تسعى المدرسة أيضاً إلى غرس القيم الأخلاقية والوطنية في نفوس الطلاب، من خلال البرامج التربوية والأنشطة الاجتماعية التي تساهم في بناء شخصية مسؤولة وواعية بحقوقها وواجباتها تجاه المجتمع.

بفضل بيئتها التعليمية الشاملة، وأعضاء هيئة التدريس المؤهلين، والإدارة الداعمة، تعتبر مدرسة القرية السياحية الأولى الرسمية للغات من بين أفضل الخيارات التعليمية التي تركز على إعداد جيل مؤهل أكاديميًا ومتميز اجتماعيًا، وقادر على مواجهة تحديات المستقبل بثقة وثبات.
        
        </p>

        <div className="aboutSection__image" style={{
            backgroundImage: `url(https://egyptschools.info/wp-content/uploads/2020/12/917523377.jpg)`,
          

        }}></div>

       </div> 
    </section>

  );
}